#!/bin/bash
export LD_LIBRARY_PATH="$(dirname $0)/lib64":"$LD_LIBRARY_PATH"
export PATH="$(dirname $0)/":"$PATH"
DEV=$(adb devices -l | tail +2 | cut -d: -f4 | cut -d' ' -f1)

FON="1" # "1" - если фон терминала тёмный, "2;1" - если фон тереминала светлый
RE="\e[$FON;91m"
GR="\e[$FON;92m"
YE="\e[$FON;93m"
BL="\e[$FON;94m"
WH="\e[$FON;97m" # 97 - если фон терминала тёмный, 90 - если фон тереминала светлый
EN="\e[0m"


start_int () {
if [[ $DEV = '' ]]; then
echo -e "$YE#####################################################################$EN
"$GR"Подключение телефона через Wi-Fi adb...$EN"
else
echo -e "$GRПодключение к "$YE"\"$DEV\"$EN "$GR"уже установлено!$EN"
exit 0
fi
echo -e "$WH В найстройках телефона зайдите в раздел $EN"$YE"\"Расширенные настройки\"$EN
"$WH" Найдите раздел $EN"$YE"\"Для разработчиков\"$EN "$WH"перейдите в него.
 Найдите пункт $EN"$YE"\"Беспроводная отладка\"$EN "$WH"установите флажок во ВКЛЮЧЕННОЕ положение.
 Нажмите на стрелку $EN"$YE"\">\"$EN "$WH"в этом же пункте. Вы провалитесь в подменю.
 В этом подменю отображается $EN"$YE"\"IP-адрес & Порт\"$EN "$WH"adb сервиса.$EN
"$BL"    Пример:$EN "$GR"192.168.1.2:32105$EN
"$YE"_________________________________________________________$EN"
read -p "Введите значение из этого поля здесь: " IPPORT1
echo -e "$YE#####################################################################$EN
"$WH" Теперь нажмите на пункт $EN"$YE"\"Подключение устройств через код подключения\"$EN.
"$WH" Вы увидите $EN"$YE"\"Код подключения Wi-Fi\"$EN "$WH"большими шрифтом.
"$BL"    Пример:$EN "$YE"Код подключения Wi-Fi:$EN "$GR"850651$EN
"$YE"__________________________________________________________$EN"
read -p "Введите значение из этого поля здесь: " CODE
echo -e "$YE#####################################################################$EN
$WH "$WH"Ниже отображается$EN "$YE"\"IP-адрес & Порт\"$EN "$WH"сервиса авторизации.$EN
"$BL"    Пример:$EN "$YE"IP-адрес & Порт:$EN "$GR"192.168.1.2:40105$EN
"$WH" Сейчас нужно ввести только$EN "$YE"Порт$EN "$WH"- число которое расположено после двоеточия.$EN
"$BL"    Пример:$EN "$GR"40105$EN
"$YE"__________________________________________________________$EN"
read -p "Введите значение из этого поля здесь: " PORT2
echo -e "$YE#####################################################################$EN
"$GR"Выполняется подключение...$EN"
IP=$(echo $IPPORT1 | cut -d: -f1)
PORT1=$(echo $IPPORT1 | cut -d: -f2)
adb pair "$IP":"$PORT2" $CODE && \
adb connect "$IP":"$PORT1"
DEV=$(adb devices -l | tail +2 | cut -d: -f4 | cut -d' ' -f1)
if [[ $DEV = '' ]]; then
echo -e "$YE#####################################################################$EN
"$RE"Подключение не удалось!$EN
"$WH"Через 5 секунд запуститься повторная попытка, или зажмите$EN "$GR"Ctrl + c$EN "$WH"для отмены
и завершения скрипта подключения.$EN
"$YE"#####################################################################$EN"
sleep 8
start_int
else
echo -e "$YE#####################################################################$EN
"$GR"Подключение устройства "$YE"\"$DEV\"$EN "$GR"успешно завершено!$EN"
fi
exit 0
}

check_dev() {
if [[ $DEV != '' ]]; then
echo -e "$GRПодключение к "$YE"\"$DEV\"$EN "$GR"уже установлено!$EN"
exit 0
else
$STATUS
echo -e "$YEПодключений не найдено!$EN"
exit 0
fi
}

start_cli() {
IP=$(echo $a2 | cut -d: -f1)
PORT1=$(echo $a2 | cut -d: -f2)
CODE=$(echo $a3)
PORT2=$(echo $a4)
echo -e "$YE###########################################################$EN
"$GR"Выполняется подключение...$EN"
adb pair "$IP":"$PORT2" $CODE && \
adb connect "$IP":"$PORT1"
DEV=$(adb devices -l | tail +2 | cut -d: -f4 | cut -d' ' -f1)
if [[ $DEV = '' ]]; then
echo -e "$REПодключение не удалось!$EN";
exit 1
else
echo -e "$YE###########################################################$EN
"$GR"Подключение устройства "$YE"\"$DEV\"$EN "$GR"успешно завершено$EN"
exit 0
fi
}

helpa() {
echo -e "
    $RE./connect.sh$EN "$YE"-c$EN или "$YE"--cli$EN "$GR"IP:PORT1$EN "$GR"CODE$EN "$GR"PORT2$EN

  "$GR"IP:PORT1$EN "$WH"- \"IP-адрес & Порт\"$EN из окна "$WH"\"Беспроводная отладка\"$EN.
  "$GR"CODE$EN "$WH"- \"Код подключения Wifi\"$EN из окна "$WH"\"Подключить устройство через код подключения\"$EN.
  "$GR"PORT2$EN - из "$WH"\"IP-адрес & Порт\"$EN из окна "$WH"\"Подключить устройство через код подключения\"$EN
          только "$WH"\"Порт\"$EN который после двоеточия.

    $RE./connect.sh$EN "$YE"-l$EN или "$YE"--list$EN - выводит информацию о наличии подключенного устройства.
"
exit 0
}

a2=$2
a3=$3
a4=$4
case "$1" in
  '') ;;
  -c|--cli) STATUS='start_cli'; check_dev ;;
  -l|--list) STATUS=''; check_dev ;;
  -h|--help) helpa ;;
  *) echo -e "$REДопущена ошибка в написании ключей$EN"; exit 1 ;;
esac

start_int
